{
  "en": {
    "translation": {
      "bad_request": {
        "title": "Bad Request",
        "detail": "The server cannot or will not process the request due to something that is perceived to be a client error"
      },

      "unauthorized": {
        "title": "Unauthorized",
        "detail": "The request has not been applied because it lacks valid authentication credentials for the target resource."
      },

      "forbidden": {
        "title": "Forbidden",
        "detail": "Authentication credentials were provided in the request, but the server considers them insufficient to grant access"
      },


      "verification_required": {
        "title": "Verification Required",
        "detail": "An email-based session verification code is required to access this account"
      },

      "authenticator_required": {
        "title": "Authenticator Required",
        "detail": "A TOTP 2-factor authenticator is required to access this account"
      },

      "reset_required": {
        "title": "Password Reset Required",
        "detail": "A password reset is required to access this account"
      },

      "not_found": {
        "title": "Not Found",
        "detail": "The origin server did not find a current representation for the target resource or is not willing to disclose that one exists."
      },

      "method_not_allowed": {
        "title": "Method Not Allowed",
        "detail": "The method received in the request-line is known by the origin server but not supported by the target resource."
      },

      "conflict": {
        "title": "Conflict",
        "detail": "The request could not be completed due to a conflict with the current state of the target resource."
      },

      "gone": {
        "title": "Gone",
        "detail": "The target resource is no longer available at the origin server and this condition is likely to be permanent."
      },

      "payload_too_large": {
        "title": "Payload Too Large",
        "detail": "The server is refusing to process a request because the request payload is larger than the server is willing or able to process."
      },

      "unsupported_media_type": {
        "title": "Unsupported Media Type",
        "detail": "The origin server is refusing to service the request because the payload is in a format not supported by this method on the target resource."
      },

      "im_a_teapot": {
        "title": "I'm a teapot",
        "detail": "This server is a teapot, it may be short and stout."
      },

      "unprocessable_entity": {
        "title": "Unprocessable Entity",
        "detail": "The server understands the content type of the request entity and the syntax of the request entity is correct but was unable to process the contained instructions."
      },

      "too_many_requests": {
        "title": "Too Many Requests",
        "detail": "The user has sent too many requests in a given amount of time and has been rate limited."
      },

      "internal_server": {
        "title": "Internal Server Error",
        "detail": "The server encountered an unexpected condition that prevented it from fulfilling the request."
      },

      "not_implemented": {
        "title": "Not Implemented",
        "detail": "The server does not support the functionality required to fulfill the request."
      }
    }
  }
}
